/* Swedish versions of kiki texts */
/* translation by Ivan aka Fenris */
 
/* game title */

"kiki the nano bot" = "Nanoroboten Kiki";

/* menu */

"new game" = "nytt spel";
"load level" = "ladda bana";
"next level" = "nästa bana";
"restart" = "börja om";
"setup" = "inställningar";
"story" = "bakgrundshistoria";
"demo" = "demo";
"about" = "om spelet";
"help" = "hjälp";
"quit" = "avsluta";
"back" = "tillbaka";

/* about */

"version" = "version";
"programmed by" = "skrivet av";
"sounds from" = "ljud från";
"thanks to" = "tack till";
"visit" = "besök";
"for more games" = "för fler spel";
"main menu" = "huvudmeny";

/* story */

"STORY_PAGE_1" = "det var en gång\nsmå, små robotar\n\nsom levde i nano-världen.\n\nde levde ett lyckligt konstgjort liv,\noch samlade flitigt material\nåt skaparen\nsom byggde fler och fler\npyttesmå robotar.";

"STORY_PAGE_2" = "men en dag\nförstörde en parasitmakt\nskaparens kontrollprogram.\n\n\nSedan dess är han trasig\noch bygger bara\nkorkade och lata små robotar\nsom skjuter varandra och\nförstör nano-världen.";

"STORY_PAGE_3" = "din uppgift är att hjälpa kiki,\nden sista kloka roboten,\natt reparera skaparen.\n\nlycka till!";

/* setup */

"off" = "av";
"on" = "på";
"sound" = "ljud";
"volume" = "volym";
"fullscreen" = "fullskärmsläge";
"fov" = "synfält";
"speed" = "hastighet";
"keyboard setup" = "tangentbordsinställningar";
"save" = "spara";

/* keyboard setup */

"$no_itemkeyboard setup" = "$no_itemtangentbordsinställningar"; // don't translate $no_item
"$no_item" = "$no_item"; // don't change this

"move forward" = "gå framåt";
"move backward" = "gå bakåt";
"turn left" = "sväng vänster";
"turn right" = "sväng höger";
"jump" = "hoppa";
"push" = "knuffa";
"shoot" = "skjut";
"change view" = "ändra synvinkel";
"look up" = "titta uppåt";
"look down" = "titta nedåt";
    
"press the new key" = "tryck på den nya knappen";
"action without key" = "knapplös handling";
"back to setup" = "tillbaka till inställningar";

/* help */

"HELP_SPIKES_1" = "$scale(1.5)mission:\nta dig till utgången!\n\nse upp för spikarna!\ngå bara över dem\nom de är infällda!";

"HELP_GOLD_1" = "$scale(1.5)mission:\nta dig till utgången!\n\nför att komma dit\nska du flytta stenarna.\n\ntryck på\"$key(push)\"+\"$key(move forward)\"för att knuffa dem.";

"HELP_JUMP_1" = "$scale(1.5)mission:\nta dig till utgången!\n\nför att komma dit\nska du hoppa över kuberna.\n\ntryck på \"$key(jump)\" för att hoppa.";

"HELP_JUMP_2" = "för att hoppa framåt ska du,\ntrycka på \"$key(jump)\"+\"$key(move forward)\"\n\ndu kan vända dig\nmedan du hoppar!\n\ntryck på \"$key(turn left)\"\neller \"$key(turn right)\" för att vända dig!";

